model {
  ssd {
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 640
        width: 640
      }
    }
    feature_extractor {
      type: "ssd_resnet50_v1_fpn_keras"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 0.00037
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.03
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.997
          scale: true
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
      fpn {
        min_level: 3
        max_level: 7
      }
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      weight_shared_convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 0.000397
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.01
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.997
            scale: true
            epsilon: 0.001
          }
        }
        depth: 256
        num_layers_before_predictor: 4
        kernel_size: 3
        class_prediction_bias_init: -4.6
      }
    }
    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 4.0
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        scales_per_octave: 2
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-08
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 2
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_object_covered: 0.0
      min_aspect_ratio: 0.75
      max_aspect_ratio: 3.0
      min_area: 0.75
      max_area: 1.0
      overlap_thresh: 0.0
    }
  }
  sync_replicas: true
  optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.04
          total_steps: 25000
          warmup_learning_rate: 0.013333
          warmup_steps: 2000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "/app/project/experiments/pretrained_model/ssd_resnet50_v1_fpn_640x640_coco17_tpu-8/checkpoint/ckpt-0"
  num_steps: 35000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  use_bfloat16: false
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/app/project/data/train/processed/segment-16080705915014211452_620_000_640_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1422926405879888210_51_310_71_310_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14388269713149187289_1994_280_2014_280_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16042842363202855955_265_000_285_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11004685739714500220_2300_000_2320_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15903184480576180688_3160_000_3180_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16093022852977039323_2981_100_3001_100_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14753089714893635383_873_600_893_600_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14619874262915043759_2801_090_2821_090_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16345319168590318167_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13238419657658219864_4630_850_4650_850_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11060291335850384275_3761_210_3781_210_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12879640240483815315_5852_605_5872_605_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15903544160717261009_3961_870_3981_870_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11718898130355901268_2300_000_2320_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12337317986514501583_5346_260_5366_260_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14098575914252965554_511_000_531_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15844593126368860820_3260_000_3280_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11139647661584646830_5470_000_5490_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10927752430968246422_4940_000_4960_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1352150727715827110_3710_250_3730_250_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13271285919570645382_5320_000_5340_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15445436653637630344_3957_561_3977_561_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11925224148023145510_1040_000_1060_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15036582848618865396_3752_830_3772_830_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15943938987133888575_2767_300_2787_300_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12365808668068790137_2920_000_2940_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12581809607914381746_1219_547_1239_547_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14479353969865741728_2340_000_2360_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11388947676680954806_5427_320_5447_320_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11355519273066561009_5323_000_5343_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10584247114982259878_490_000_510_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12848519977617081063_2488_000_2508_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14073578965827700743_1564_000_1584_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15374821596407640257_3388_480_3408_480_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1191788760630624072_3880_000_3900_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14810689888487451189_720_000_740_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10241508783381919015_2889_360_2909_360_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1083056852838271990_4080_000_4100_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11392401368700458296_1086_429_1106_429_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1605912288178321742_451_000_471_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11588853832866011756_2184_462_2204_462_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12858738411692807959_2865_000_2885_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1146261869236413282_1680_000_1700_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15241656472211725662_2500_000_2520_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10327752107000040525_1120_000_1140_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16388696051060074747_140_000_160_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10096619443888687526_2820_000_2840_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13862220583747475906_1260_000_1280_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14076089808269682731_54_730_74_730_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13909033332341079321_4007_930_4027_930_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1382515516588059826_780_000_800_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14143054494855609923_4529_100_4549_100_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11799592541704458019_9828_750_9848_750_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14183710428479823719_3140_000_3160_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14766384747691229841_6315_730_6335_730_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10723911392655396041_860_000_880_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15868625208244306149_4340_000_4360_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1022527355599519580_4866_960_4886_960_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12551320916264703416_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10275144660749673822_5755_561_5775_561_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1208303279778032257_1360_000_1380_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15803855782190483017_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12896629105712361308_4520_000_4540_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11113047206980595400_2560_000_2580_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1051897962568538022_238_170_258_170_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11379226583756500423_6230_810_6250_810_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12956664801249730713_2840_000_2860_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15834329472172048691_2956_760_2976_760_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13830510593707564159_5575_000_5595_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13585809231635721258_1910_770_1930_770_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10061305430875486848_1080_000_1100_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11971497357570544465_1200_000_1220_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15857303257471811288_1840_000_1860_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13181198025433053194_2620_770_2640_770_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10923963890428322967_1445_000_1465_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14466332043440571514_6530_560_6550_560_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10517728057304349900_3360_000_3380_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10750135302241325253_180_000_200_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11017034898130016754_697_830_717_830_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10498013744573185290_1240_000_1260_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10599748131695282446_1380_000_1400_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10963653239323173269_1924_000_1944_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12566399510596872945_2078_320_2098_320_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15578655130939579324_620_000_640_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15458436361042752328_3549_030_3569_030_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15331851695963211598_1620_000_1640_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11623618970700582562_2840_367_2860_367_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14276116893664145886_1785_080_1805_080_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15942468615931009553_1243_190_1263_190_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16087604685956889409_40_000_60_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13807633218762107566_6625_000_6645_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14869732972903148657_2420_000_2440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1432918953215186312_5101_320_5121_320_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10786629299947667143_3440_000_3460_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12979718722917614085_1039_490_1059_490_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14734824171146590110_880_000_900_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16262849101474060261_3459_585_3479_585_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13177337129001451839_9160_000_9180_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13310437789759009684_2645_000_2665_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10500357041547037089_1474_800_1494_800_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10676267326664322837_311_180_331_180_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13679757109245957439_4167_170_4187_170_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14752341928540512649_4960_000_4980_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13840133134545942567_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11252086830380107152_1540_000_1560_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13033853066564892960_1040_000_1060_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10391312872392849784_4099_400_4119_400_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14018515129165961775_483_260_503_260_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12012663867578114640_820_000_840_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14106113060128637865_1200_000_1220_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10596949720463106554_1933_530_1953_530_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12212767626682531382_2100_150_2120_150_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16238753252899859750_1340_000_1360_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14964691552976940738_2219_229_2239_229_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10876852935525353526_1640_000_1660_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15270638100874320175_2720_000_2740_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15448466074775525292_2920_000_2940_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1306458236359471795_2524_330_2544_330_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14233522945839943589_100_000_120_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14830022845193837364_3488_060_3508_060_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10625026498155904401_200_000_220_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13254498462985394788_980_000_1000_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15696964848687303249_4615_200_4635_200_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10072140764565668044_4060_000_4080_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14250544550818363063_880_000_900_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12339284075576056695_1920_000_1940_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13984577671034960830_4545_000_4565_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16224018017168210482_6353_500_6373_500_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1416654423768444853_2660_000_2680_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12179768245749640056_5561_070_5581_070_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15266427834976906738_1620_000_1640_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10526338824408452410_5714_660_5734_660_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10975280749486260148_940_000_960_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16042886962142359737_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15053781258223091665_3192_117_3212_117_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10094743350625019937_3420_000_3440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13476374534576730229_240_000_260_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14073491244121877213_4066_056_4086_056_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11236550977973464715_3620_000_3640_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13085453465864374565_2040_000_2060_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15646511153936256674_1620_000_1640_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15533468984793020049_800_000_820_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13519445614718437933_4060_000_4080_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1005081002024129653_5313_150_5333_150_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10734565072045778791_440_000_460_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12505030131868863688_1740_000_1760_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13182548552824592684_4160_250_4180_250_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15349503153813328111_2160_000_2180_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13629997314951696814_1207_000_1227_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15125792363972595336_4960_000_4980_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16105359875195888139_4420_000_4440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14763701469114129880_2260_000_2280_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10153695247769592104_787_000_807_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15265053588821562107_60_000_80_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13517115297021862252_2680_000_2700_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14818835630668820137_1780_000_1800_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1172406780360799916_1660_000_1680_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13667377240304615855_500_000_520_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11566385337103696871_5740_000_5760_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15832924468527961_1564_160_1584_160_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11343624116265195592_5910_530_5930_530_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15717839202171538526_1124_920_1144_920_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10235335145367115211_5420_000_5440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15482064737890453610_5180_000_5200_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11846396154240966170_3540_000_3560_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13078892192456386060_2960_000_2980_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10964956617027590844_1584_680_1604_680_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14705303724557273004_3105_000_3125_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10588771936253546636_2300_000_2320_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12174529769287588121_3848_440_3868_440_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12321865437129862911_3480_000_3500_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10940952441434390507_1888_710_1908_710_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14004546003548947884_2331_861_2351_861_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16341778301681295961_178_800_198_800_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12303641360375776820_4378_000_4398_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12200383401366682847_2552_140_2572_140_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13355317306876751663_2200_000_2220_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13258835835415292197_965_000_985_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16372013171456210875_5631_040_5651_040_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12900898236728415654_1906_686_1926_686_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11489533038039664633_4820_000_4840_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13186511704021307558_2000_000_2020_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13363977648531075793_343_000_363_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13390791323468600062_6718_570_6738_570_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10023947602400723454_1120_000_1140_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16336545122307923741_486_637_506_637_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16331619444570993520_1020_000_1040_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14824622621331930560_2395_420_2415_420_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14777753086917826209_4147_000_4167_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11918003324473417938_1400_000_1420_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16202688197024602345_3818_820_3838_820_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15342828002152531464_1543_000_1563_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12681651284932598380_3585_280_3605_280_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15795616688853411272_1245_000_1265_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11183906854663518829_2294_000_2314_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11847506886204460250_1640_000_1660_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14133920963894906769_1480_000_1500_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13207915841618107559_2980_000_3000_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10793018113277660068_2714_540_2734_540_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11219370372259322863_5320_000_5340_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15535062863944567958_1100_000_1120_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14742731916935095621_1325_000_1345_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11940460932056521663_1760_000_1780_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14424804287031718399_1281_030_1301_030_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1305342127382455702_3720_000_3740_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10231929575853664160_1160_000_1180_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12027892938363296829_4086_280_4106_280_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13402473631986525162_5700_000_5720_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13731697468004921673_4920_000_4940_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1442753028323350651_4065_000_4085_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11674150664140226235_680_000_700_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16191439239940794174_2245_000_2265_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10212406498497081993_5300_000_5320_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12894036666871194216_787_000_807_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13142190313715360621_3888_090_3908_090_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14940138913070850675_5755_330_5775_330_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15308653868652290306_460_000_480_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14561791273891593514_2558_030_2578_030_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12844373518178303651_2140_000_2160_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10664823084372323928_4360_000_4380_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1231623110026745648_480_000_500_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14964131310266936779_3292_850_3312_850_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13619063687271391084_1519_680_1539_680_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13196796799137805454_3036_940_3056_940_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10724020115992582208_7660_400_7680_400_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16121633832852116614_240_000_260_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15379350264706417068_3120_000_3140_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10226164909075980558_180_000_200_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15367782110311024266_2103_310_2123_310_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14193044537086402364_534_000_554_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12257951615341726923_2196_690_2216_690_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11839652018869852123_2565_000_2585_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16208935658045135756_4412_730_4432_730_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15787777881771177481_8820_000_8840_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1473681173028010305_1780_000_1800_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12988666890418932775_5516_730_5536_730_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12251442326766052580_1840_000_1860_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16034875274658204340_240_000_260_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14098605172844003779_5084_630_5104_630_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13622747960068272448_1678_930_1698_930_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11126313430116606120_1439_990_1459_990_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10017090168044687777_6380_000_6400_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10107710434105775874_760_000_780_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10206293520369375008_2796_800_2816_800_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15365821471737026848_1160_000_1180_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12281202743097872109_3387_370_3407_370_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10444454289801298640_4360_000_4380_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15221704733958986648_1400_000_1420_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15644354861949427452_3645_350_3665_350_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1357883579772440606_2365_000_2385_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12856053589272984699_1020_000_1040_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10455472356147194054_1560_000_1580_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10082223140073588526_6140_000_6160_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15550613280008674010_1780_000_1800_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12511696717465549299_4209_630_4229_630_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12974838039736660070_4586_990_4606_990_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14348136031422182645_3360_000_3380_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12473470522729755785_4000_000_4020_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-12208410199966712301_4480_000_4500_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-13944915979337652825_4260_668_4280_668_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-15539619898625779290_760_000_780_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10075870402459732738_1060_000_1080_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11119453952284076633_1369_940_1389_940_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-1265122081809781363_2879_530_2899_530_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-10072231702153043603_5725_000_5745_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11070802577416161387_740_000_760_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-14369250836076988112_7249_040_7269_040_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-16153607877566142572_2262_000_2282_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/train/processed/segment-11318901554551149504_520_000_540_000_with_camera_labels.tfrecord"
  }
}
eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/app/project/data/val/processed/segment-141184560845819621_10582_560_10602_560_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-15202102284304593700_1900_000_1920_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-1255991971750044803_1700_000_1720_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-12304907743194762419_1522_000_1542_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-13940755514149579648_821_157_841_157_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-16102220208346880_1420_000_1440_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-14503113925613619599_975_506_995_506_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-13823509240483976870_1514_190_1534_190_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-12161824480686739258_1813_380_1833_380_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-11967272535264406807_580_000_600_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-13145971249179441231_1640_000_1660_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-12273083120751993429_7285_000_7305_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-14430914081327266277_6480_000_6500_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-13506499849906169066_120_000_140_000_with_camera_labels.tfrecord"
    input_path: "/app/project/data/val/processed/segment-11454085070345530663_1905_000_1925_000_with_camera_labels.tfrecord"
  }
}
